app/Controllers/Auth.php

INSERT INTO `users` (`full_name`, `email`, `password`, `role`, `phone_num`, `gender`, `profile_image`) VALUES ('Aina Nadirah', 'ainanadirah613@gmail.com', '$2y$10$DI5dg4zxDNDt8ErfL3k7wOJ43kRprDLLdomJ3MmrE.l7Ca6ICGSBq', 'admin', '0133964530', 'female', NULL)
---
        ];

        // 5. Save User
        $userModel->save($data);