app/Controllers/Auth.php

    public function registerProcess()
    {
        $rules = [
            'role'      => 'required|in_list[trainee,trainer]',
            'full_name' => 'required|min_length[2]',
            'email'     => 'required|valid_email',
            'password'  => 'required|min_length[8]',
            'gender'    => 'required|in_list[male,female]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()
                ->withInput()
                ->with('errors', $this->validator->getErrors());
        }

        $role = $this->request->getPost('role');

        $data = [
            'full_name' => $this->request->getPost('full_name'),
            'email'     => $this->request->getPost('email'),
            'password'  => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'gender'    => $this->request->getPost('gender')
        ];

        if ($role === 'trainee') {

            $traineeModel = new TraineeModel();

            // Check unique email
            if ($traineeModel->where('email', $data['email'])->first()) {
---
SELECT *
FROM `trainees`
WHERE `email` = 'rahmat456@gmail.com'
 LIMIT 1


            $data['phone_num'] = $this->request->getPost('phone_num');

            $traineeModel->insert($data);
---
INSERT INTO `trainees` (`full_name`, `email`, `password`, `gender`, `phone_num`, `created_at`) VALUES ('Rahmat Bin Syukur', 'rahmat456@gmail.com', '$2y$10$bkDFxeyun.8g0Xm.xW/a9OlMMR8MpPqGm8tjtpgI2alepjqifD6cy', 'male', '01185694236', '2026-01-10 15:26:44')

    public function loginProcess()
    {
        $role     = $this->request->getPost('role');
        $email    = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        if (!$role || !$email || !$password) {
            return redirect()->back()->with('error', 'All fields are required');
        }

        if ($role === 'trainee') {
            $model = new TraineeModel();
            $user  = $model->where('email', $email)->first();
---
SELECT *
FROM `trainees`
WHERE `email` = 'aisyahumaira55@gmail.com'
 LIMIT 1