app/Controllers/CoursesController.php

SELECT `status`, COUNT(*) AS count
FROM `course_enrollments`
WHERE `trainee_id` = '1'
GROUP BY `status`
---
    public function enrolled()
    {
        $builder = $this->db->table('course_enrollments ce');
        $builder->select('c.course_id, c.course_name, c.course_desc, ce.status');
        $builder->join('courses c', 'c.course_id = ce.course_id');
        $builder->where('ce.trainee_id', session()->get('user_id'));

        $data['courses'] = $builder->get()->getResultArray();