app/Controllers/CoursesController.php

SELECT `ce`.`course_enroll_id`, `c`.`course_id`, `c`.`course_name`, `c`.`course_desc`, `c`.`course_image`, `ce`.`status`, `ce`.`progress`
FROM `course_enrollments` `ce`
JOIN `courses` `c` ON `c`.`course_id` = `ce`.`course_id`
WHERE `ce`.`trainee_id` = '1'
---
    public function enrolled()
    {
        $user_id = session()->get('user_id');

        $builder = $this->db->table('course_enrollments ce');
        $builder->select('ce.course_enroll_id, c.course_id, c.course_name, c.course_desc, c.course_image, ce.status, ce.progress');
        $builder->join('courses c', 'c.course_id = ce.course_id');
        $builder->where('ce.trainee_id', $user_id);

        $data['courses'] = $builder->get()->getResultArray();

SELECT `c`.`course_id`, `c`.`course_name`, `c`.`course_desc`, `ce`.`status`
FROM `course_enrollments` `ce`
JOIN `courses` `c` ON `c`.`course_id` = `ce`.`course_id`
WHERE `ce`.`trainee_id` IS NULL
AND `ce`.`status` = 'Completed'
SELECT *
FROM `courses`
---
    public function inProgress()
    {
        $user_id = session()->get('user_id');

        $builder = $this->db->table('course_enrollments ce');
        $builder->select('ce.course_enroll_id, c.course_id, c.course_name, c.course_desc, c.course_image, ce.status, ce.progress');
        $builder->join('courses c', 'c.course_id = ce.course_id');
        $builder->where('ce.trainee_id', $user_id);
        $builder->whereIn('ce.status', ['Enrolled', 'Paid', 'In Progress']);

        $courses = $builder->get()->getResultArray();

SELECT `c`.`course_name`, `t`.`full_name`, `ce`.`completed_date`
FROM `course_enrollments` `ce`
JOIN `courses` `c` ON `c`.`course_id` = `ce`.`course_id`
JOIN `trainees` `t` ON `t`.`trainee_id` = `ce`.`trainee_id`
WHERE `ce`.`trainee_id` = '3'
AND `ce`.`course_id` = '7'
AND `ce`.`status` = 'Completed'
---
    public function certificate($course_id)
    {
        $user_id = session()->get('user_id');

        $builder = $this->db->table('course_enrollments ce');
        $builder->select('c.course_name, t.full_name, ce.completed_date');
        $builder->join('courses c', 'c.course_id = ce.course_id');
        $builder->join('trainees t', 't.trainee_id = ce.trainee_id');
        $builder->where('ce.trainee_id', $user_id);
        $builder->where('ce.course_id', $course_id);
        $builder->where('ce.status', 'Completed');

        $course = $builder->get()->getRowArray();