app/Controllers/HomeController.php

SELECT COUNT(*) AS `numrows`
FROM `course_enrollments`
WHERE `trainee_id` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `course_enrollments`
WHERE `trainee_id` IS NULL
AND `status` = 'In Progress'
SELECT COUNT(*) AS `numrows`
FROM `course_enrollments`
WHERE `trainee_id` IS NULL
AND `status` = 'Completed'
SELECT *
FROM `courses`
 LIMIT 8
---
    public function index()
    {
        $enrollModel = new CourseEnrollmentModel();
        $courseModel = new CourseModel();

        // Count courses
        $data['courses_enrolled'] = $enrollModel->where('trainee_id', session()->get('user_id'))->countAllResults();
        $data['courses_in_progress'] = $enrollModel->where('trainee_id', session()->get('user_id'))
            ->where('status', 'In Progress')->countAllResults();
        $data['courses_completed'] = $enrollModel->where('trainee_id', session()->get('user_id'))
            ->where('status', 'Completed')->countAllResults();

        // Get 8 available courses
        $data['available_courses'] = $courseModel->limit(8)->findAll();