app/Controllers/TraineeProfileController.php

SELECT *
FROM `trainees`
WHERE `trainees`.`trainee_id` = '5'
---
    public function index()
    {
        $session = session();
        $userId = $session->get('user_id');
        $role   = $session->get('role');

        // Security check: must be logged in and must be a trainee
        if (!$session->get('isLoggedIn') || $role !== 'trainee') {
            return redirect()->to('/login');
        }

        $model = new TraineeModel();
        $data['trainee'] = $model->find($userId);

SELECT *
FROM `trainees`
WHERE `trainees`.`trainee_id` = '5'
---
    public function edit_profile()
    {
        $session = session();
        $userId = $session->get('user_id');
        $role   = $session->get('role');

        if (!$session->get('isLoggedIn') || $role !== 'trainee') {
            return redirect()->to('/login');
        }

        $model = new TraineeModel();
        $data['trainee'] = $model->find($userId);

UPDATE `trainees` SET `full_name` = 'Aisyah Humaira', `email` = 'aisyahumaira55@gmail.com', `phone_num` = '01159671236', `date_of_birth` = '2006-11-13', `gender` = 'female', `created_at` = '2026-01-16 12:49:53'
WHERE `trainees`.`trainee_id` IN ('5')
---
        }

        // 4. Update Database
        if ($traineeModel->update($traineeId, $data)) {