app/Controllers/TrainerController.php

SELECT *
FROM `trainers`
---
    public function trainer()
    {
        // Fetch all trainers from database
        $trainers = $this->trainerModel->findAll();