app/Controllers/TrainerProfileController.php

    public function index()
    {
        $session = session();
        $userId = $session->get('user_id');
        $role   = $session->get('role');

        // Verify the user is logged in and is a trainer
        if (!$session->get('isLoggedIn') || $role !== 'trainer') {
            return redirect()->to('/login');
        }

        $model = new TrainerModel();
        $data['trainer'] = $model->find($userId);
---
SELECT *
FROM `trainers`
WHERE `trainers`.`trainer_id` = '6'