app/Models/TraineeModel.php

SELECT `t`.`trainee_id`, `t`.`full_name`, `t`.`email`, `t`.`gender`, `c`.`course_name`, `p`.`payment_status`
FROM `trainees` `t`
LEFT JOIN `course_enrollments` `ce` ON `ce`.`trainee_id` = `t`.`trainee_id`
LEFT JOIN `courses` `c` ON `c`.`course_id` = `ce`.`course_id`
LEFT JOIN `payments` `p` ON `p`.`course_enroll_id` = `ce`.`course_enroll_id`
---
    public function getTraineesWithDetails($keyword = null)
    {
        $builder = $this->db->table('trainees t');

        $builder->select('
            t.trainee_id,
            t.full_name,
            t.email,
            t.gender,
            c.course_name,
            p.payment_status
        ');

        $builder->join('course_enrollments ce', 'ce.trainee_id = t.trainee_id', 'left');
        $builder->join('courses c', 'c.course_id = ce.course_id', 'left');
        $builder->join('payments p', 'p.course_enroll_id = ce.course_enroll_id', 'left');

        if ($keyword) {
            $builder->groupStart()
                ->like('t.full_name', $keyword)
                ->orLike('t.email', $keyword)
                ->orLike('c.course_name', $keyword)
                ->groupEnd();
        }

        return $builder->get()->getResultArray();